export type Lang = {
  title: string;
  desc: string;
};

export interface TranslateProps {
  hi: Lang;
  en: Lang;
  ma: Lang;
  od: Lang;
}

export type LangKey = "en" | "hi" | "ma" | "od";

export const Translate = {
  hi: {
    title: "हमारे बारे में",
    desc: `ट्रावॉय में आपका स्वागत है! हम दुनिया की खोज करने और इसके चमत्कारों को आपके साथ साझा करने के लिए समर्पित यात्रियों, कहानीकारों और साहसिक-प्रेमियों का एक जुनूनी समूह हैं। हमारी यात्रा एक साधारण यात्रा प्रेम से शुरू हुई - छिपे हुए रत्नों को खोजने, नए स्वादों का स्वाद लेने और दूर-दूर तक की संस्कृतियों से जुड़ने की इच्छा। अब, हम यहां हैं आपको अपनी खुद की यात्राओं पर प्रेरित और मार्गदर्शन करने के लिए। शानदार पहाड़ी यात्राओं से लेकर व्यस्त शहर की सड़कों तक, शांत समुद्र तटों से लेकर दूर-दराज के गांवों तक, हमने आपको प्रामाणिक कहानियाँ, व्यावहारिक सुझाव और शानदार दृश्य लाने के लिए दुनिया की यात्रा की है। चाहे आप एक अनुभवी यात्री हों या अपनी पहली यात्रा का सपना देख रहे हों, हमारे पास आपके लिए कुछ न कुछ है - हमें अपने यात्रा साथी के रूप में सोचें, बिना सामान के! हमारा मिशन? आपकी यात्रा की इच्छा को प्रज्वलित करना, आपको अविस्मरणीय यात्राओं की योजना बनाने में मदद करना, और दिखाना कि यात्रा सिर्फ एक गंतव्य नहीं है - यह बढ़ने, जुड़ने और ताजगी भरी आँखों से दुनिया को देखने का एक तरीका है। हमारे साथ जुड़ें जैसे हम क्षितिज का पीछा करते हैं, एक कहानी एक समय में। खुशहाल यात्राएँ, ट्रावॉय टीम`,
  },
  en: {
    title: "About Us",
    desc: `Welcome to travoy! We’re a passionate group of wanderers, storytellers, and adventure-seekers dedicated to exploring the world and sharing its wonders with you. Our journey began with a simple love for travel—a desire to uncover hidden gems, taste new flavors, and connect with cultures far and wide. Now, we’re here to inspire and guide you on your own adventures. From breathtaking mountain hikes to bustling city streets, from serene beaches to off-the-beaten-path villages, we’ve roamed the globe to bring you authentic stories, practical tips, and stunning visuals. Whether you’re a seasoned traveler or just dreaming of your first trip, we’ve got something for you—think of us as your travel companions, minus the luggage! Our mission? To ignite your wanderlust, help you plan unforgettable journeys, and show that travel is more than just a destination—it’s a way to grow, connect, and see the world through fresh eyes. Join us as we chase horizons, one story at a time. Happy travels, The Travoy Team`,
  },
  ma: {
    title: "आमच्याबद्दल",
    desc: `ट्रावॉयमध्ये आपले स्वागत आहे! आम्ही जगाचा शोध घेण्यासाठी आणि त्याचे चमत्कार तुमच्यासोबत शेअर करण्यासाठी समर्पित प्रवासी, कथाकार आणि साहसी-प्रेमींचा एक उत्साही गट आहोत. आमची यात्रा एका साध्या प्रवासाच्या प्रेमाने सुरू झाली - लपलेले रत्न शोधण्याची, नवीन चवींचा आस्वाद घेण्याची आणि दूरवरच्या संस्कृतींशी जोडण्याची इच्छा. आता, आम्ही येथे आहोत तुम्हाला तुमच्या स्वतःच्या प्रवासावर प्रेरित आणि मार्गदर्शन करण्यासाठी. नेत्रदीपक पर्वतीय ट्रेकपासून ते गजबजलेल्या शहराच्या रस्त्यांपर्यंत, शांत समुद्रकिनाऱ्यांपासून ते दूरच्या गावांपर्यंत, आम्ही तुम्हाला प्रामाणिक कथा, व्यावहारिक टिप्स आणि नेत्रदीपक दृश्ये आणण्यासाठी जगभर फिरलो आहोत. तुम्ही अनुभवी प्रवासी असाल किंवा तुमच्या पहिल्या प्रवासाचे स्वप्न पाहत असाल, आमच्याकडे तुमच्यासाठी काहीतरी आहे - आम्हाला तुमचे प्रवासी साथीदार समजा, सामानाशिवाय! आमचे ध्येय? तुमच्या प्रवासाची इच्छा प्रज्वलित करणे, तुम्हाला अविस्मरणीय प्रवासाची योजना करण्यात मदत करणे आणि प्रवास हे फक्त एक गंतव्यस्थान नाही हे दाखवणे - हे वाढण्याचा, जोडण्याचा आणि ताज्या डोळ्यांनी जग पाहण्याचा एक मार्ग आहे. आम्हाला सामील व्हा जसे आम्ही क्षितिजाचा पाठलाग करतो, एक कथा एकावेळी. आनंदी प्रवास, ट्रावॉय टीम`,
  },
  od: {
    title: "ଆମ ବିଷୟରେ",
    desc: `ଟ୍ରାଭୋୟରେ ଆପଣଙ୍କୁ ସ୍ବାଗତ! ଆମେ ପ୍ରବାସୀ, କାହାଣୀକାର ଏବଂ ଜଗତକୁ ଅନ୍ବେଷଣ କରିବା ଏବଂ ଏହାର ଆଶ୍ଚର୍ଯ୍ୟଗୁଡ଼ିକୁ ଆପଣଙ୍କ ସହିତ ଅଂଶୀଦାର କରିବା ପାଇଁ ଉତ୍ସାହିତ ଏକ ଦଳ ଅଟେ। ଆମର ଯାତ୍ରା ଏକ ସରଳ ଭ୍ରମଣ ପ୍ରେମରୁ ଆରମ୍ଭ ହୋଇଥିଲା - ଲୁଚା ରତ୍ନଗୁଡ଼ିକୁ ଖୋଜିବା, ନୂତନ ସ୍ବାଦଗୁଡ଼ିକୁ ଚାଖିବା ଏବଂ ଦୂର ଦୂର ଯାଇ ସଂସ୍କୃତିଗୁଡ଼ିକୁ ଯୋଡ଼ିବାର ଇଚ୍ଛା। ଏବେ, ଆମେ ଆପଣଙ୍କୁ ଆପଣଙ୍କ ନିଜସ୍ୱ ଯାତ୍ରାରେ ପ୍ରେରିତ ଏବଂ ମାର୍ଗଦର୍ଶନ କରିବା ପାଇଁ ଏଠାରେ ଅଛୁ। ଚକାଚକ୍ୟା ମାଉଣ୍ଟେନ୍ ହାଇକ୍ସରୁ ନିର୍ବିକଳ୍ପ ସହର ରାସ୍ତାଗୁଡ଼ିକ ପର୍ଯ୍ୟନ୍ତ, ଶାନ୍ତ ସମୁଦ୍ର ସମୁଦ୍ରକୂଳରୁ ଅପରିଚିତ ଗ୍ରାମଗୁଡ଼ିକ ପର୍ଯ୍ୟନ୍ତ, ଆମେ ଆପଣଙ୍କୁ ପ୍ରାମାଣିକ କାହାଣୀ, ବ୍ୟାବହାରିକ ସୁପାରିଶ ଏବଂ ଚକାଚକ୍ୟା ଭିଜୁଆଲ୍ ଆଣିବା ପାଇଁ ପୃଥିବୀକୁ ଭ୍ରମଣ କରିଛୁ। ଆପଣ ଏକ ଅନୁଭବୀ ଯାତ୍ରୀ କିମ୍ବା ଆପଣଙ୍କ ପ୍ରଥମ ଯାତ୍ରାର ସ୍ବପ୍ନ ଦେଖୁଛନ୍ତି, ଆମ ପାଖରେ ଆପଣଙ୍କ ପାଇଁ କିଛି ନ କିଛି ଅଛି - ଆମକୁ ଆପଣଙ୍କ ଯାତ୍ରା ସହଭାଗୀ ଭାବରେ ଭାବନ୍ତୁ, ସାମାନ୍ୟ ଛାଡ଼ି! ଆମର ମିଶନ୍? ଆପଣଙ୍କ ଯାତ୍ରା ଇଚ୍ଛାକୁ ଜ୍ୱଳନ କରିବା, ଆପଣଙ୍କୁ ଅବିସ୍ମରଣୀୟ ଯାତ୍ରାର ଯୋଜନା କରିବାରେ ସାହାଯ୍ୟ କରିବା, ଏବଂ ଦେଖାଇବା ଯେ ଯାତ୍ରା କେବଳ ଏକ ଗନ୍ତବ୍ୟ ସ୍ଥାନ ନୁହେଁ - ଏହା ବୃଦ୍ଧି, ଯୋଡ଼ାଯୋଡ଼ ଏବଂ ତାଜା ଆଖିରେ ପୃଥିବୀକୁ ଦେଖିବାର ଏକ ପ୍ରକ୍ରିୟା। ଆମ ସହିତ ଯୋଡ଼ନ୍ତୁ ଯେପରିକି ଆମେ ଦୃଶ୍ୟର ପଛରେ ଧାଉଛୁ, ଏକ କାହାଣୀ ଏକ ସମୟରେ। ଖୁସି ଯାତ୍ରା, ଟ୍ରାଭୋୟ ଟିମ୍`,
  },
};
